{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "id2label": {
    "0": "rag_query",
    "1": "professional",
    "2": "psychological",
    "3": "learning",
    "4": "social",
    "5": "emotional",
    "6": "aspirational",
    "7": "chitchat"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "aspirational": 6,
    "chitchat": 7,
    "emotional": 5,
    "learning": 3,
    "professional": 1,
    "psychological": 2,
    "rag_query": 0,
    "social": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
